#!/bin/bash
#-------------------------------------------------------------------------------------------------------------------------------------
#    Objectif  :  Téléchargement des données du modèle AROME à partir du HPC (ONM). 
#    Version   :  PNT/01-Mai-2022
#    Consignes :  C'est une version exportable, modifier uniquement le fichier de config "date.config" avant le lancement
#    Execution :  ./0-ARO_GET_DATA.sh
#-------------------------------------------------------------------------------------------------------------------------------------
source date.config
#-------------------------------------------------------------------------------------------------------------------------------------
DATADIR=$HOME/RESTOR/AROME/data
#-------------------------------------------------------------------------------------------------------------------------------------
if [ $rr -eq 00 ] ; then
RES=r0
else
RES=r12
fi
#-------------------------------------------------------------------------------------------------------------------------------------
cd $DATADIR/$RES
rm -r *
#-------------------------------------------------------------------------------------------------------------------------------------
echo "*******************************************************************************************************************************"
echo "*  >  Téléchargement des données AROME  :                                                                                     *"
echo "*                                                                                                                             *"
echo "*                 Situation  du  $JJ/$MM/$AA  ;  Réseau ${rr}h  ;  Echéance :  00h - ${ECH}h                                         *"
echo "*                                                                                                                             *"
echo "*******************************************************************************************************************************"
#-------------------------------------------------------------------------------------------------------------------------------------
for i in $(seq -f "%04g" 0 3 ${ECH}) ; do
sshpass -p "password" scp -r hpc@address:/fennecData/data/chprod/AROME/FULLPOS//$AA/$MM/$JJ/r${rr}/FULLPOS_${AA}${MM}${JJ}${rr}_${i}  .
done
#-------------------------------------------------------------------------------------------------------------------------------------
echo "************ Vérification de la disponibilité des données dans $DATADIR/$RES ************"
for i in $(seq -f "%04g" 0 3 ${ECH}) ; do
if [ -f FULLPOS_${AA}${MM}${JJ}${rr}_${i} ] ; then
      echo " Fichier FULLPOS_${AA}${MM}${JJ}${rr}_${i} disponible "
else
      echo " Fichier FULLPOS_${AA}${MM}${JJ}${rr}_${i} non disponible   >>>>>>  Demander à la DIT de vous fournir ces données  "
fi
done
exit
